ruiofang/ESP32S3-TFT-BS/sdkconfig.defaults
# Project default sdkconfig - applied via `idf.py reconfigure`.
# These keys ensure BLE (NimBLE) stays enabled for the Claude status mode.

# ---- Target ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash / partition ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- OTA rollback ----
# A freshly OTA'd image boots in PENDING_VERIFY state. ota_updater_init() arms a
# 30s timer that calls esp_ota_mark_app_valid_cancel_rollback() once the system
# is up; if we crash/reset before that fires the bootloader rolls back.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---- BLE (NimBLE, peripheral only) ----
# Memory footprint is tuned down to leave DRAM for WiFi (softAP runs concurrently).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4608
# Disable NimBLE bonding storage in NVS so no stale keys persist between flashes
# CONFIG_BT_NIMBLE_NVS_PERSIST is not set
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y

# SM stays enabled but configured at runtime for "just works, no bonding".
# Disabling SM entirely caused some hosts (Linux BlueZ) to still emit pairing
# requests that we couldn't respond to, dropping the link with HCI 0x05.
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y

# ---- BLE controller: shrink to 1 peripheral activity, no scan duplication cache ----
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_ADV_DUP_FILT_MAX=4
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=8
CONFIG_BT_CTRL_BLE_ADV_REPORT_DISCARD_THRSHOLD=4
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=4

# ---- WiFi: trim buffers so BT controller has DRAM headroom ----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# ---- LVGL: switch to libc malloc so the 128 KB allocator pool doesn't
# sit as a static array in internal BSS. With SPIRAM_MALLOC_ALWAYSINTERNAL
# already at 16 KB, big LVGL allocations route to PSRAM automatically. This
# was eating ~120 KB of internal RAM that mbedTLS / esp-aes needed for OTA.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y

# ---- mbedTLS: shrink SSL buffers + free after handshake ----
# Without this, mbedTLS pins 16KB IN + 4KB OUT static SSL buffers per session
# in internal RAM; combined with LVGL widgets demo + WiFi + BLE this caused
# `esp-aes: Failed to allocate memory` during the OTA manifest read.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
